aalgo.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cxml="http://tempuri.org/">
<soapenv:Header/>
<soapenv:Body>
<cxml:EnvioCFE>
<cxml:nomusuario>erp2</cxml:nomusuario>
<cxml:clave>erp2</cxml:clave>
<cxml:tenant>morale</cxml:tenant>
<cxml:cliente></cxml:cliente>
<cxml:cfexml><![CDATA[<?xml version="1.0" encoding="UTF-8" ?>
<nsAdenda:CFE_Adenda xmlns:nsAdenda="http://cfe.dgi.gub.uy">
<nsAd:CFE version="1.0" xmlns:nsAd="http://cfe.dgi.gub.uy">
<nsAd:eFact>
 <nsAd:Encabezado>
<nsAd:IdDoc>
<nsAd:TipoCFE>112</nsAd:TipoCFE>
<nsAd:Serie></nsAd:Serie>
<nsAd:Nro></nsAd:Nro>
<nsAd:FchEmis>2019-09-19</nsAd:FchEmis>
<nsAd:MntBruto>1</nsAd:MntBruto>
<nsAd:FmaPago>2</nsAd:FmaPago>
</nsAd:IdDoc>
<nsAd:Emisor>
<nsAd:RUCEmisor>120132110017</nsAd:RUCEmisor>
<nsAd:RznSoc>Heriberto Daniel Morales Ayende</nsAd:RznSoc>
<nsAd:NomComercial>Morales Repuestos</nsAd:NomComercial>
<nsAd:EmiSucursal>Sucursal principal</nsAd:EmiSucursal>
<nsAd:CdgDGISucur>2</nsAd:CdgDGISucur>
<nsAd:DomFiscal>Rep. Argentina 1718</nsAd:DomFiscal>
<nsAd:Ciudad>PAYSANDU</nsAd:Ciudad>
<nsAd:Departamento>PAYSANDU</nsAd:Departamento>
</nsAd:Emisor>
<nsAd:Receptor>
<nsAd:TipoDocRecep>2</nsAd:TipoDocRecep>
<nsAd:CodPaisRecep>UY</nsAd:CodPaisRecep>
<nsAd:DocRecep>214971680011</nsAd:DocRecep>
<nsAd:RznSocRecep>1534 - SHOPSTAR S.A.   ( ABC )</nsAd:RznSocRecep>
<nsAd:DirRecep>18 DE JULIO 1120</nsAd:DirRecep>
<nsAd:CiudadRecep>PAYSANDU</nsAd:CiudadRecep>
<nsAd:DeptoRecep>PAYSANDU</nsAd:DeptoRecep>
<nsAd:PaisRecep>URUGUAY</nsAd:PaisRecep>
</nsAd:Receptor>
<nsAd:Totales>
<nsAd:TpoMoneda>UYU</nsAd:TpoMoneda><nsAd:MntNoGrv>0.00</nsAd:MntNoGrv>
<nsAd:MntNetoIvaTasaMin>0.00</nsAd:MntNetoIvaTasaMin>
<nsAd:MntNetoIVATasaBasica>976.23</nsAd:MntNetoIVATasaBasica>
<nsAd:IVATasaMin>10</nsAd:IVATasaMin>
<nsAd:IVATasaBasica>22</nsAd:IVATasaBasica>
<nsAd:MntIVATasaMin>0.00</nsAd:MntIVATasaMin>
<nsAd:MntIVATasaBasica>214.77</nsAd:MntIVATasaBasica>
<nsAd:MntTotal>1191</nsAd:MntTotal>
<nsAd:CantLinDet>4</nsAd:CantLinDet>
<nsAd:MontoNF>0.0</nsAd:MontoNF>
<nsAd:MntPagar>1191</nsAd:MntPagar>
</nsAd:Totales>
 </nsAd:Encabezado>
<nsAd:Detalle>
<nsAd:Item>
<nsAd:NroLinDet>1</nsAd:NroLinDet>
<nsAd:IndFact>3</nsAd:IndFact>
<nsAd:NomItem>2-Bonificacion en eFactura A-5377</nsAd:NomItem>
<nsAd:Cantidad>1</nsAd:Cantidad>
<nsAd:UniMed>UN</nsAd:UniMed>
<nsAd:PrecioUnitario>913.00</nsAd:PrecioUnitario>
<nsAd:MontoItem>913.00</nsAd:MontoItem>
</nsAd:Item>
<nsAd:Item>
<nsAd:NroLinDet>2</nsAd:NroLinDet>
<nsAd:IndFact>3</nsAd:IndFact>
<nsAd:NomItem>2-Bonificacion en eFactura A-5386</nsAd:NomItem>
<nsAd:Cantidad>1</nsAd:Cantidad>
<nsAd:UniMed>UN</nsAd:UniMed>
<nsAd:PrecioUnitario>96.00</nsAd:PrecioUnitario>
<nsAd:MontoItem>96.00</nsAd:MontoItem>
</nsAd:Item>
<nsAd:Item>
<nsAd:NroLinDet>3</nsAd:NroLinDet>
<nsAd:IndFact>3</nsAd:IndFact>
<nsAd:NomItem>2-Bonificacion en eFactura A-5460</nsAd:NomItem>
<nsAd:Cantidad>1</nsAd:Cantidad>
<nsAd:UniMed>UN</nsAd:UniMed>
<nsAd:PrecioUnitario>132.00</nsAd:PrecioUnitario>
<nsAd:MontoItem>132.00</nsAd:MontoItem>
</nsAd:Item>
<nsAd:Item>
<nsAd:NroLinDet>4</nsAd:NroLinDet>
<nsAd:IndFact>3</nsAd:IndFact>
<nsAd:NomItem>2-Bonificacion en eFactura A-5493</nsAd:NomItem>
<nsAd:Cantidad>1</nsAd:Cantidad>
<nsAd:UniMed>UN</nsAd:UniMed>
<nsAd:PrecioUnitario>50.00</nsAd:PrecioUnitario>
<nsAd:MontoItem>50.00</nsAd:MontoItem>
</nsAd:Item>
</nsAd:Detalle>
<nsAd:Referencia>
<nsAd:Referencia>
<nsAd:NroLinRef>         1</nsAd:NroLinRef>
<nsAd:TpoDocRef>111</nsAd:TpoDocRef>
<nsAd:Serie>A </nsAd:Serie>
<nsAd:NroCFERef>5377</nsAd:NroCFERef>
<nsAd:FechaCFEref>2019-08-14</nsAd:FechaCFEref>
</nsAd:Referencia>
<nsAd:Referencia>
<nsAd:NroLinRef>         2</nsAd:NroLinRef>
<nsAd:TpoDocRef>111</nsAd:TpoDocRef>
<nsAd:Serie>A </nsAd:Serie>
<nsAd:NroCFERef>5386</nsAd:NroCFERef>
<nsAd:FechaCFEref>2019-08-14</nsAd:FechaCFEref>
</nsAd:Referencia>
<nsAd:Referencia>
<nsAd:NroLinRef>         3</nsAd:NroLinRef>
<nsAd:TpoDocRef>111</nsAd:TpoDocRef>
<nsAd:Serie>A </nsAd:Serie>
<nsAd:NroCFERef>5460</nsAd:NroCFERef>
<nsAd:FechaCFEref>2019-08-19</nsAd:FechaCFEref>
</nsAd:Referencia>
<nsAd:Referencia>
<nsAd:NroLinRef>         4</nsAd:NroLinRef>
<nsAd:TpoDocRef>111</nsAd:TpoDocRef>
<nsAd:Serie>A </nsAd:Serie>
<nsAd:NroCFERef>5493</nsAd:NroCFERef>
<nsAd:FechaCFEref>2019-08-21</nsAd:FechaCFEref>
</nsAd:Referencia>
</nsAd:Referencia>
<nsAd:CAEData>
<nsAd:CAE_ID>1</nsAd:CAE_ID>
<nsAd:DNro>1</nsAd:DNro>
<nsAd:HNro>1</nsAd:HNro>
<nsAd:FecVenc></nsAd:FecVenc>
</nsAd:CAEData>
</nsAd:eFact>
</nsAd:CFE>
<nsAdenda:Adenda>Obs:                                                                                                                                                                                                                                                                &lt;br&gt;Cliente Nro: 1534 - SHOPSTAR S.A.   ( ABC )&lt;br&gt;Ref: 355858</nsAdenda:Adenda></nsAdenda:CFE_Adenda>
]]></cxml:cfexml>
<cxml:referenciaERP>355858</cxml:referenciaERP>
<cxml:devolverQR>0</cxml:devolverQR>
<cxml:sizeQR>10</cxml:sizeQR>
<cxml:impprime>0</cxml:impprime>
<cxml:template>Uso General</cxml:template>
<cxml:devolverXML>0</cxml:devolverXML>
<cxml:version></cxml:version>
</cxml:EnvioCFE>
</soapenv:Body>
</soapenv:Envelope>
